vinnie-wu/elec_291_projects/Lab-06/Lab-06-PIC32.c
#include <XC.h>
#include <stdio.h>
#include <stdlib.h>
 
// Configuration Bits (somehow XC32 takes care of this)
#pragma config FNOSC = FRCPLL       // Internal Fast RC oscillator (8 MHz) w/ PLL
#pragma config FPLLIDIV = DIV_2     // Divide FRC before PLL (now 4 MHz)
#pragma config FPLLMUL = MUL_20     // PLL Multiply (now 80 MHz)
#pragma config FPLLODIV = DIV_2     // Divide After PLL (now 40 MHz)
 
#pragma config FWDTEN = OFF         // Watchdog Timer Disabled
#pragma config FPBDIV = DIV_1       // PBCLK = SYCLK

// Defines
#define SYSCLK 40000000L
#define Baud2BRG(desired_baud)( (SYSCLK / (16*desired_baud))-1)
 
void UART2Configure(int baud_rate)
{
    // Peripheral Pin Select
    U2RXRbits.U2RXR = 4;    //SET RX to RB8
    RPB9Rbits.RPB9R = 2;    //SET RB9 to TX

    U2MODE = 0;         // disable autobaud, TX and RX enabled only, 8N1, idle=HIGH
    U2STA = 0x1400;     // enable TX and RX
    U2BRG = Baud2BRG(baud_rate); // U2BRG = (FPb / (16*baud)) - 1
    
    U2MODESET = 0x8000;     // enable UART2
}

// Good information about ADC in PIC32 found here:
// http://umassamherstm5.org/tech-tutorials/pic32-tutorials/pic32mx220-tutorials/adc
void ADCConf(void)
{
    AD1CON1CLR = 0x8000;    // disable ADC before configuration
    AD1CON1 = 0x00E0;       // internal counter ends sampling and starts conversion (auto-convert), manual sample
    AD1CON2 = 0;            // AD1CON2<15:13> set voltage reference to pins AVSS/AVDD
    AD1CON3 = 0x0f01;       // TAD = 4*TPB, acquisition time = 15*TAD 
    AD1CON1SET=0x8000;      // Enable ADC
}

int ADCRead(char analogPIN)
{
    AD1CHS = analogPIN << 16;    // AD1CHS<16:19> controls which analog pin goes to the ADC
 
    AD1CON1bits.SAMP = 1;        // Begin sampling
    while(AD1CON1bits.SAMP);     // wait until acquisition is done
    while(!AD1CON1bits.DONE);    // wait until conversion done
 
    return ADC1BUF0;             // result stored in ADC1BUF0
}

void main(void)
{
	volatile unsigned long t=0;
    int adcval;
    float voltage;
    float temperature;

	CFGCON = 0;
  
    UART2Configure(115200);  // Configure UART2 for a baud rate of 115200
 
    // Configure pins as analog inputs
    ANSELBbits.ANSB3 = 1;   // set RB3 (AN5, pin 7 of DIP28) as analog pin
    TRISBbits.TRISB3 = 1;   // set RB3 as an input
    
	TRISBbits.TRISB6 = 0;
	LATBbits.LATB6 = 0;	

    TRISBbits.TRISB10 = 0;
	LATBbits.LATB10 = 0;	

    TRISBbits.TRISB12 = 0;
	LATBbits.LATB12 = 0;	

	INTCONbits.MVEC = 1;

    ADCConf(); // Configure ADC
 
    printf("*** PIC32 ADC test ***\r\n");
	while(1)
	{
		t++;
		if(t==500000)
		{
        	adcval = ADCRead(5); // note that we call pin AN5 (RB3) by it's analog number
        	voltage=adcval*(3.298)/1023.0;
            temperature = 100.0*(voltage-2.73);
        	printf("%.3f\n",temperature);
        	fflush(stdout);
			t = 0;
			// LATBbits.LATB6 = !LATBbits.LATB6; // Blink led on RB6
		}
        if(temperature>=30){
            LATBbits.LATB6 = 0;
        }else{
            LATBbits.LATB6 = 1;
        }

        if(temperature>=32){
             LATBbits.LATB10 = 0;
         }else{
            LATBbits.LATB10 = 1;
         }
         
        if(temperature>=33){
            LATBbits.LATB12 = 0;
        }else{
            LATBbits.LATB12 = 1;
         }
	}
}

